#გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ
for name in range(13):
    print("nino")

#გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით
for i in range(21):
    print(i)

#გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე
for i in range(21,0,-1):
    print(i)

#დაბეჭდეთ 1-დან 5-ის ჩათვლით რიცხვთა კვადრატი(n * n)
for i in range(5):
    print(i*i)

#დაბეჭდეთ ყველა ლუწი რიცხვის ჯამი 1-დან 10-ის ჩათვლით
for i in range(11):
    print(i+i)

#მომხარებელს შემოატანინეთ რიცხვი და შეინახეთ ცვლადში, შემდეგ კი 0-დან 
#შემოტანილი რიცხვის ჩათვლით შეამოწმეთ, თუ ლუწია დაბეჭდეთ რიცხვი is Even, სხვა 
#შემთხვევაში რიცხვი is Odd;(მაგალითად 4, ლუწია ამიტომაც დაბეჭდავთ "4 is Even")
number=int(input("please add number:"))
for num in range(0,number+1):
    if num % 2==0:
        print(str(num)+ "is even")
else:
    print(str(num) + "is odd")





