#დაითვალეთ რამდენი ლუწი რიცხვია 1-დან 50-ის ჩათვლით(გამოიყენეთ for loop-ი)
count = 0
for number in range(1, 50+1):
    if number % 2 == 0:
        count += 1
        print(number)
#დაბეჭდეთ 1-დან 100-მდე ყველა ლუწი რიცხვის საშუალო არითმეტიკული. გამოიყენეთ while loop-ი.(დაგჭირდებათ ორი ცვლადის შექმნა, ერთში შეინახავთ ჯამს, მეორეში რაოდენობას)
#1)შევქმნათ ცვლადი,ერთ-ცვლადში შევინახოთ ჯამი და მეორეში შევინახოთ რაოდენობა
#2)გამოვიყენოთ while/loop-ი 
for number in range(1, 101):
    if number % 10 == 0:
        print(number)
#დაბეჭდეთ ყველა რიცხვი 1-დან 30-მდე, რომელიც იყოფა 3-ზე(გამოიყენეთ while loop-ი)
for number in range(1, 31):
    if number % 3 == 0:
        print(number)
#დაწერეთ პროგრამა, რომელიც მომხარებელს შემოატანინებს რიცხვს და დაბეჭდავს ეს რიცხვი დადებითია, უარყოფითია თუ 0-ია
while True:
    number = int(input("შეიყვანეთ რიცხვი: "))
    if number == 0:
        print("რიცხვი არის 0")
        break
    else:
        print(f" რიცხვი არის {number}")

#დაწერეთ პროგრამა, რომელიც მომხარებელს შემოატანინებს წელს და გაიგებს არის თუ არა ის ნაკიანი(წელი როდესაც თებერვალში 29 დღე გვაქვს). ნაკიანი არის წელი თუ ის იყოფა 4-ზე და არ იყოფა 100-ზე ან 
#იყოფა 400-ზე.(გამოიყენეთ and და or ოპერატორები)
year = int(input("Please entar a year: "))

if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
    print("ეს წელი არის ნაკიანი")
else:
    print("ეს წელი არ არის ნაკიანი")
#მომხმარებელს შემოატანინეთ რიცხვი 1-დან 100-ის ჩათვლით(ეს იქნება მისი ქულა). თუ მაგალითად 90-დან 100-ის ჩათვლით ექნება ქულა გამოუტანეთ "Your grade is A", თუ 80-დან 90-მდე, გამოუტანეთ 
#"Your grade is B", თუ 70-დან 80-მდე გამოუტანეთ "Your grade is C", 
#სხვა შემთხვევაში გამოუტანეთ "Your grade is D"
score = int(input("შეიყვანეთ თქვენი ქულა (1-დან 100-ის ჩათვლით): "))
if 90 <= score <= 100:
    print("Your grade is A")
elif 80 <= score < 90:
    print("Your grade is B")
elif 70 <= score < 80:
    print("Your grade is C")
else:
    print("Your grade is D")
