// TSP - Transmission Control Protocol, არის ყველაზე ხშირად გამოყენებადი protocol - ი ინტერნეტში, TCP ამყარებს კავშირს ორ კომპიუტერს შორის, იგივე client - სა 
// და server - ს შორის, client (browser) - ი  HTTP GET  - ით აგზავნის მოთხოვნას server - თან, server - ი აბრუნებს საჭირო ფაილებს, 
// TCP - ის დახმარებით client - ი აგზავნის მოთხოვნებს, მომხმარებლის მიერ გამოგზავნილი მოთხოვნები server თან მივა იგივე თანმიმდევრობით რა თანმიმდევრობითაც გააგზავნა
// client - მა მოთხოვნა, TCP - ი უზრუნველყოფს რომ დაბრუნებული მონაცემები server - იდან client - ამდე მივიდეს უსაფრთხოდ

// UDP - User Datagram Protocol, TCP - ისგან განსხვავებით UDP - არ ამოწმებს მივიდა თუ არა მონაცემები client - ამდე უსაფრთხოდ, არ აგზავნის მონაცემებს თანმიმდევრულად, 
// არის სწრაფი, UDP - არის სწრაფი გზა რომ გავგზავნოთ მონაცემები