#დავალება-1
# bug - error - შეცდომა
# debugger - ერორების გამასწორებელი

#დავალება-2
#შეცდომით დაწერილი კოდი 
x="salome"
print(name)
#სწორი კოდი 
name="lizi"
print(name)


#დავალება-3
#1
x=5
y=8
print(x+y)
#2
print(10+40)
#3
age1=13
age2=14
age3=15
print(age1+age2+age3)
#4
num1=30
num2=40
print(num1+num2)
#5
x=20
y=10
print(x/y)
#6
num1=25
num2=4
print(num1*num2)
#7
print(700-100)
#8
#find an average
age1=16
age2=14
age3=15
print(age1+age2+age3/3)
#9
num1=50
num2=20
num3=8
print(num1-num2/num3)
#10
age1=39
age2=37
age3=14
age4=13
print(age1+age2+age3+age4)
#დავალება-5
#კომპიუტერის დროებითი მეხსიერება,რომელსაც RAM (Random Access Memory)ეწოდება,არის მოწყობილობის 
#ნაწილი,რომელიც ინახავს ინფორმაციას და მონაცემებს,რომლებსაც კომპიუტერი ამჟამად იყენებს.RAM-ზე 
#მონაცემები ინახება დროებით,რაც იმას ნიშნავს,რომ კომპიუტერის გამორთვისას ეს ინფორმაცია იკარგება. 
#მისი მთავარი დანიშნულება პროცესების სწრაფი და ეფექტური შესრულებაა,რაც უზრუნველყოფს მას პროგრამებისა
#და ფაილების სწრაფად ატვირთვაში.

