const array = [1,2,3,4,5];

const me = {
    name: 'Nino', 
    lastname: 'Gvinjilia'
}

console.table(array);
console.table(me);

// module - ი არის ისეთი ფაილი რომელიც აე - export - ებს ობიექტს ან ფუნქციას

// მოდულარობა - კოდების ცალკეულ ფაილებში გადანაწილება

// ჩაშენებული მოდულები არის ის რაც თავიდანვე მოყვა პროგრამას მაგალითად os არის ჩაშენებული module - ი

// გარე მოდულები არის ისეთი მოდულები რომლებიც არ მოყვა თავიდანვე პროგრამას, მაგრამ ჩვენ შეგვიძლია მათი დამატება

// გლობალური მოდული არის ისეთი მოდული რომელიც ხელმისაწვდომია ყველგან მაგალითად console ი არის გლობალური მოდული ის არის ხელმისაწვდომი
// ყველგან

// გამშვები გარემო არის ისეთი გარემო სადაც ეშვება კოდი

console.log(process.argv);

console.log(parseInt(process.argv[2]) + parseInt(process.argv[3]));

console.log(process.memoryUsage());
console.log(process.memoryUsage().heapUsed / (1024 * 1024));

// process - ი არის ობიექტი რომელიც გვაძლევს ინფორმაციას ამჟამინდელი კოდის შესახებ
// argv არის იგივე არგუმენტები მას default - ად აქვს გადაცემული ჩვენი ფაილის მისამართი სადაც ვწერთ კოდს და პროგრამული ფაილები