#ჩატ-ბოტი არის პროგრამა, რომელიც არის შექმნილი ადამიანთან ურთიერთობისთვის. ის იყენებს ხელოვნურ ინტელექტს,
#რომ გაიგოს შეკითხვა და უპასუხოს მას. ჩატ ბოტემს შეუძლიათ შეკითხვებზე პასუხის გაცემა, პერსონალური 
#რეკომენდაცია(თქვენი შეხედულების მიხედვით შემოგთავაზებენ სხვადასხვა პროდუქტებს და ა.შ)
#თქვენი დავალებაა შექმნათ მარტივი ჩატ-ბოტი, რომელიც კოდის გაშვებისთანავე მიესალმება მომხარებელს და ჰკითხავს "How are your?", 
#თუ მომხარებელი შეიყვანს, "Normal" დაბეჭდეთ "Bot:I hope you will get better", სხვა შემთხვევაში თუ შემოიყვანს "Great", დაუბეჭდეთ 
#"Bot:Good! Have a nice day", ხოლო თუ შემოიყვანა "Sad" ან "Super Sad" დაუბეჭდეთ "Bot:It's sad". საბოლოოდ დაბეჭდეთ "Good bye!" და გათიშეთ while ციკლი. 
#ამისათვის მას გადაეცით სწორი პირობა(მინიშნება: შექმენით ცვლადი რომლის მნიშვნელობა თავიდან იქნება False, while ციკლს პირობად გაუწერეთ ეს ცვლადი, 
#თუ მომხარებელმა სწორი ინფორმაცია შემოიყვანა მისი ნიშვნელობა გახდება True და როცა ყველა პირობა შესრულდება while ციკლი გაითიშება).
#თუ მომხარებელი შემოიყვანს ისეთ ინფორმაციას რაზეც თქვენი ბოტი არ არის დაპროგრამირებული, დაბეჭდეთ "Bot: Sorry, I didn't understand, repeat.
#"(ამ შემთხვევაში while ციკლისთვის შექმნილი ცვლადის მნიშვნელობა არ იცვლება და ციკლი არ წყვეტს მუშაობას)
#დაგჭირდებათ: while loop; input; if/else; and or.
#თქვენი სურვილით დაამატეთ სხვა ფუნქციები და გააუმჯობესეთ ჩატ-ბოტი
running=True
while running:
    user=print("How are you?")
    User=(input("You:"))
    if User=="Normal":
        print("Chatbot:" "I hope you will get better")
        running=False
    elif User=="Great":
        print("Chatbot:" "Good! Have a nice day")
        running=False
    elif User=="Sad" or User=="Very sad":
        print("Chatbot:" "It's sad")
    running=False
else:
    print("Good bye!")