// 3) შექმენით ერთი ფუნქცია findMax რომელიც არგუმენტად იღებს რიცხვებს, rest operator - ის გამოყენებით იპოვეთ ამ რიცხვებს შორის ყველაზე დიდი რიცხვი
const findMax = (...numbers) => {
    return Math.max(...numbers)
}

console.log(findMax(1,2,3,14,4,5,6));
// 4) შექმენით ორი მასივი რომელმაც უნდა გააერთიანოს ორივე მასივის მნიშვნელობები ახალ ცარიელ მასივში, გამოიყენეთ spread operator - ი ამ დავალების შესასრულებლად 
const array1 = [1,2,3,4,5,6,7,8,9,10];
const array2 = [11,12,13,14,15,16,17,18,19,20];
const joinedArray = [...array1,...array2];
console.log(joinedArray);
// 5) შექმენით user obj, ობიექტი სადაც უნდა შეინახოთ მომხმარებლის სახელი გვარი და ასაკი დესტრუქციის გამოყენებით უნდა ამოიღოთ ამ მომხმარებლის 
// სახელი,ასაკი და გამოიტანოთ console - ში
const user = {
    name:'Nino',
    lastname:'Gvinjilia',
    age:13
}

const {name,age} = user;
console.log(name,age)
// 6) შექმენით ობიექტი რომელსაც მიანიჭებთ თქვენ სახელს,გვარს,ასაკს და თქვენ hobby - ის,
// თქვენი დავალებაა, რომ spread ოპერატორის გამოყენებით ამოიღოთ მხოლოდ თქვენი სახელი და hobby - ი ხოლო დანარჩენი კუთვნილებების მნიშვნელობები 
// უნდა დატოვოთ ჩვეულებრივად
const myObj = {
    name1:'Nino',
    lastname:'Gvinjilia',
    age:13,
    hobby:'Reading'
}

const {name1,hobby, ...myObjInfo} = myObj;
console.log(name1);
console.log(hobby);
console.log(myObjInfo);

// 7) ყველაფერი ახსენით კომენტარებით თუ (რა დროს ვიყენებთ rest,spread ოპერატორებს, რა არის დესტრუქცია)

// ჩვენ ვიყენებთ rest operator - ს როდესაც ჩვენ გვინდა ფუნქციიდან მასივიდან არგუმენტების შეგროვება 
// spread ოპერატორი გამოიყენება მაშინ როდესაც ჩვენ გვინდა რომ მასივის ან ობიექტის მნიშვნელობები განვავრცოთ
// დესტრუქცია არის იგივე რაღაც ობიექტიდან ან მასივიდან მნიშვნელობების ამოღება მაგალითად გვაქვს ობიექტი სახელად user
// რომელსაც აქვს გასაღებები keys იგივე კუთვნილებები და values იგივე მათი მნიშვნელობები თუ ჩვენ გვინდა რომ ამ ობიექტიდან ამოვიღთ სახელი და გვარი 
// გამოვიყენებთ ობიექტის დესტრუქციას const {name,age} = user; დავწერთ იმ კუთვნილებების სახელებს keys რომლის ამოღებაც გვსურს ამის შემდეგ დავწერთ ტოლობას 
// და დავწერთ იმ ობიექტის სახელს რომელი ობიექტიდანაც გვინდა ამოვიღოთ კონკრეტული კუთვნილებები და მათი მნიშვნელობები