// indexing - ის გარეშე შემოწმდა 14 დოკუმენტი, შესაბამისად წაიღო შედარებით დიდი დრო

// შევქმენით ერთი index - ი, tags - ამ index - ში დაემატა ყველა ის დოკუმენტი რომელმაც
// დააკმაყოფილა ჩვენს მიერ დაწერილი პირობა, ამ შემთხვევაში ჩაემატა ყველა ის დოკუმენტი რომლის მასივშიც იყო 
// მოცემული frontend მნიშვნელობა, შესაბამისად წაიღო უფრო ცოტა დრო, indexing - ი ჩვენ გვეხმარება უფრო ორგანიზებულად მუშაობაში

// მოხდა ოპტიმიზირება რადგან tags - ების მასივში არსებული მნიშვნელობები გადანაწილდა tags_1 ინდექსში, ოპტიმიზირების შემდეგ შეამოწმდა 2 
// დოკუმენტი  ყველა დოკუმენტის ნაცვლად