const express = require('express');
const morgan = require('morgan');
require('dotenv').config();
const postRouter = require('./routers/post.router');

const app = express();

app.use(express.json());

// 1) მოიძიეთ ინფორმაცია morgan ის შესახებ და გააკეთეთ მის პატარ კლონი (შუამავლი ფუნქციის სახით) კომენტარებით ახსენით რა არის middleware რეებს
//  შორის ეშვება ეს ფუნქცია და როგორ მუშაობს ის

app.use((req, res, next) => {
    console.log(`${req.method} ${req.url} ${res.statusCode} ${Date.now()}`);

    next();
});

/* 2) თქვენი დავალებაა მხოლოდ იმ შემთხვევაში დაბეჭდოს morgan მა ინფორმაცია როდესაც ჯერ კიდევ მუშაობის პროცესში ხართ, ამისათვის დაგჭირდებათ .env ფაილი 
(კომენტარებით ახსენით, რაში გამოიყენება ის, როგორ უნდა გამოვიყენოთ express გარემოს ცვლადები, რატომ გვიწევს dotenv მოდულის გადმოწერა), როდესაც ფაილს 
დაამატებთ მასში შექმენით ორი ცვლადი NODE_ENV და PORT, NODE_ENV შეინახეთ development ან production, შემდეგ მისი მნიშვნელობის მიხედვით გადაწყვიტეთ უნდა 
დაბეჭდოს თუ არა მორგანმა მოთხოვბნის შესახებ ინფორმაცია, აგრეთვე listen მეთოდს გადაეცით მნიშვნელობა env ფაილის გამოყენებით + გამოიყენეთ .gitignore ფაილი 
(ახსენით კომენტარებით მისი დანიშნულება) იმისათვის რომ დააგნიოროს გითმა .env და node_modules ფაილი/ფოლდერი */

if(process.env.NODE_ENV === 'development'){
    app.use(morgan('dev'));
}

// .env ფაილი გამოიყენება გარემოს ცვლადების შესანახად
// express გარემოს ცვლადების გამოყენება შეგვიძლია process.env + ცვლადის სახელის გამოყენებით
// ჩვენ dotenv module - ის გადმოწრა გვიწევს იმიტომ, რომ გამოვიყენოთ config() მეთოდი რომელიც ჩვენ გვეხმარება .env ფაილის წაკითხვაში

// .gitignore ფაილში ჩვენ ვწერთ ყველა იმ ფაილის სახელს რომელიც არ გვინდა რომ ავტვირთოთ git - ზე, მისი დანიშნულებაა დაა - ignore - ოს ყველა
// ის ფაილი რაც მასში წერია

// middleware - არის იგივე ფუნქცია რომელსაც აქვს წვდომა ორ ობიექტზე req, res, middleware ფუნქციას შეუძლია შეცვლოს req და res ობიექტები, გვაქვს რამოდენიმე 
// middleware ფუნქცია როგორიცაა express.json() ეს middleware ჩვენ გვეხმარება იმაში რომ მომხმარებლის მიერ შემოტანილი ინფორმაცია json ფორმატში წავიკითხოთ,
// morgan - ეს middleware ჩვენ გვიბრუნებს მოთხოვნის შესახებ ინფორმაციას როგორიცაა status code, route, method და ასე შემდეგ, middleware ფუნქციებს
// ჩვენ ვიყენებთ იმიტომ, რომ არ მოგვიწიოს ბევრი კოდის წერა ჩვენი ხელით, middleware ფუნქცია ეშვება ორ ობიექტს შორის ესენია req, res

app.use('/posts', postRouter);

app.listen(process.env.PORT, () => {
    console.log('The server is running')
});